Repository: Gloomydemin/Wireguard_qml
Catalog: po/*.po
Languages: ru

source: Enter password
ru: Введите пароль

source: Your password is required to use the wireguard kernel modules.
ru: Для использования модулей ядра Wireguard требуется ваш пароль.

source: Cancel
ru: Отмена

source: Connecting..
ru: Подключение...

source: Disconnected
ru: Отключено

source: Scan QR via Barcode Reader
ru: Сканировать QR через Barcode Reader

source: Scan QR code
ru: Сканировать QR-код

source: Point the camera at the QR code
ru: Наведите камеру на QR-код

source: Could not decode QR
ru: Не удалось распознать QR

source: Failed:
ru: Ошибка:

source: Profile %1 deleted
ru: Профиль %1 удалён

source: Create a new profile
ru: Создать новый профиль

source: Edit profile %1
ru: Редактировать профиль %1

source: Profile name
ru: Имя профиля

source: WireGuard configuration file
ru: Файл конфигурации WireGuard

source: Quick import from camera
ru: Быстрый импорт из камеры

source: Create manually
ru: Создать вручную

source: Fill parameters manually
ru: Заполнить параметры вручную

source: Enter a name for the imported profile
ru: Введите имя для импортируемого профиля

source: Save
ru: Сохранить

source: Please enter a profile name
ru: Введите имя профиля

source: Private Key
ru: Закрытый ключ

source: Generate
ru: Создать

source: Copy pubkey
ru: Копировать

source: IP address (with prefix length)
ru: IP-адрес (с длиной префикса)

source: Extra routes
ru: Дополнительные маршруты

source: Peer #%1
ru: Узел #%1

source: Name
ru: Имя

source: Public key
ru: Открытый ключ

source: Allowed IP prefixes
ru: Разрешённые IP-префиксы

source: Endpoint with port
ru: Конечная точка с портом

source: Preshared key
ru: Предустановленный ключ

source: Add peer
ru: Добавить узел

source: Save profile
ru: Сохранить профиль

source: Settings
ru: Настройки

source: Export tunnels to zip file
ru: Экспорт туннелей в zip-файл

source: Zip file will be saved to Downloads
ru: Zip-файл будет сохранен в папке загрузок

source: Export error:
ru: Ошибка экспорта:

source: Saved:
ru: Сохранено:

source: View application logs
ru: Просмотр журналов приложения

source: Logs may help with debugging
ru: Журналы могут помочь при отладке

source: Use userspace implementation
ru: Использовать userspace реализацию

source: May be slower and less stable
ru: Может быть медленнее и менее стабильной

source: Re-check kernel module
ru: Повторно проверить модуль ядра

source: Run kernel and sudo check wizard
ru: Запустить мастер проверки ядра и прав sudo

source: Sources and bug tracker
ru: Исходники и багтрекер

source: Open project repository
ru: Открыть репозиторий проекта

source: Kernel module is <b>not usable</b>.<br/>Will fall back to the slow, buggy, userspace implementation.
ru: Модуль ядра <b>не может быть использован</b>.<br/>Будет использована медленная, ненадёжная реализация в пользовательском пространстве.

source: Please, <b>get in touch with your device porter</b> (or with me) to add support on your device; it takes a couple of minutes only.<br/>See <a href='https://gitlab.com/ubports/community-ports/android9/xiaomi-poco-f1/kernel-xiaomi-beryllium/-/merge_requests/1'>here</a> for an example change to the kernel.
ru: Пожалуйста, <b>свяжитесь с портировщиком вашего устройства</b> (или со мной), чтобы добавить поддержку для вашего устройства; это займёт всего пару минут.<br/>Пример изменения ядра можно посмотреть <a href='https://gitlab.com/ubports/community-ports/android9/xiaomi-poco-f1/kernel-xiaomi-beryllium/-/merge_requests/1'>здесь</a>.
